Here is the plan:

```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.compute_instance.google_compute_instance_from_template.compute_instance[0] will be created
  + resource "google_compute_instance_from_template" "compute_instance" {
      + allow_stopping_for_update = (known after apply)
      + attached_disk             = (known after apply)
      + can_ip_forward            = (known after apply)
      + cpu_platform              = (known after apply)
      + deletion_protection       = (known after apply)
      + description               = (known after apply)
      + guest_accelerator         = (known after apply)
      + hostname                  = (known after apply)
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + label_fingerprint         = (known after apply)
      + labels                    = (known after apply)
      + machine_type              = (known after apply)
      + metadata                  = (known after apply)
      + metadata_fingerprint      = (known after apply)
      + metadata_startup_script   = (known after apply)
      + min_cpu_platform          = (known after apply)
      + name                      = "instance-simple-001"
      + project                   = (known after apply)
      + scratch_disk              = (known after apply)
      + self_link                 = (known after apply)
      + service_account           = (known after apply)
      + source_instance_template  = (known after apply)
      + tags                      = (known after apply)
      + tags_fingerprint          = (known after apply)
      + zone                      = "us-west1-a"

      + boot_disk {
          + auto_delete                = (known after apply)
          + device_name                = (known after apply)
          + disk_encryption_key_raw    = (sensitive value)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + source                     = (known after apply)

          + initialize_params {
              + image = (known after apply)
              + size  = (known after apply)
              + type  = (known after apply)
            }
        }

      + network_interface {
          + access_config      = (known after apply)
          + address            = (known after apply)
          + alias_ip_range     = (known after apply)
          + name               = (known after apply)
          + network            = (known after apply)
          + network_ip         = (known after apply)
          + subnetwork         = "default"
          + subnetwork_project = (known after apply)
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }
    }

  # module.instance_template.google_compute_instance_template.tpl will be created
  + resource "google_compute_instance_template" "tpl" {
      + can_ip_forward       = false
      + id                   = (known after apply)
      + machine_type         = "n1-standard-1"
      + metadata_fingerprint = (known after apply)
      + name                 = (known after apply)
      + name_prefix          = "test"
      + project              = (known after apply)
      + region               = "us-west1"
      + self_link            = (known after apply)
      + tags_fingerprint     = (known after apply)

      + disk {
          + auto_delete  = true
          + boot         = true
          + device_name  = (known after apply)
          + disk_size_gb = 100
          + disk_type    = "pd-standard"
          + interface    = (known after apply)
          + mode         = (known after apply)
          + source_image = "https://www.googleapis.com/compute/v1/projects/gce-uefi-images/global/images/centos-7-v20200403"
          + type         = (known after apply)
        }

      + network_interface {
          + address            = (known after apply)
          + network            = (known after apply)
          + subnetwork         = "default"
          + subnetwork_project = (known after apply)

          + access_config {
              + assigned_nat_ip = (known after apply)
              + nat_ip          = (known after apply)
              + network_tier    = "PREMIUM"
            }
        }

      + scheduling {
          + automatic_restart   = true
          + on_host_maintenance = (known after apply)
          + preemptible         = false
        }

      + service_account {
          + email  = "XXXXXXXXXXXX"
          + scopes = [
              + "https://www.googleapis.com/auth/compute.readonly",
              + "https://www.googleapis.com/auth/devstorage.read_only",
              + "https://www.googleapis.com/auth/userinfo.email",
            ]
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```